using System;
using System.Text;

namespace Task_2_Problem_1
{
    public static class Program
    {
// 1. Клас Meat, що має поля «Категорія» з переліку (Вищий сорт 1 сорт та 2 сорт), та «Вид» (баранина, телятина, свинина, курятина).
// 2. Клас Dairy, що має поле термін придатності, визначений в днях.
// Визначити необхідні конструктори та властивості, а також перевантажити методи класу Object для всіх сутностей.
// 3. Для всієї ієрархії передбачити метод зміни ціни.
// Для класу Product цей метод має змінювати ціну  на задану кількість відсотків.
// Для класу Meat метод має змінювати ціну на задану кількість відсотків та додатково на відсотки, визначені як сталі нормативи складу, відповідно до категорії м’яса.
// Аналогічно для класу Dairy метод має змінювати ціну  на задану кількість відсотків та додатково на відсотки, визначені як сталі нормативи складу, відповідно до терміну придатності.
// 4. Утворити клас Storage, полем якого визначити масив продуктів.
// Для цього класу описати наступні методи:
// наповнення інформацією даних у режимі діалогу з користувачем,
// наповнення інформацією даних шляхом ініціалізації,
// друку повної інформації про всі товари,
// метод знаходження всіх м’ясних продуктів,
// метод зміни ціни для всіх товарів на заданий відсоток.
// створити індексатор для повного доступу за номером до масиву товарів.

        public static void Main()
        {
            Console.OutputEncoding = Encoding.UTF8; // Ukrainian symbols in console
            UserInterface.Menu();
        }
    }
}